; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v5 ?v12)
             (pred_7 ?v10 ?v1)
             (pred_10 ?v5 ?v1)
             (pred_6 ?v3 ?v5 )
	     (pred_11 ?v5)
             (pred_4 ?v6)
             (pred_2 ?v10)
             (pred_3 ?v1)
             (pred_8 ?v5)
             (pred_9 ?v10)
             (pred_12 ?v5)
             (pred_1 ))



(:action op_4
:parameters (?v7 ?v2 ?v11 ?v4)
:precondition (and (pred_4 ?v7) (pred_4 ?v2) (pred_2 ?v11) (pred_3 ?v4)
          (pred_5 ?v7 ?v2) (pred_7 ?v11 ?v4)
                   (pred_10 ?v2 ?v4) (pred_11 ?v7) 
                   (pred_8 ?v2) (pred_9 ?v11))
:effect (and  (pred_12 ?v2) (not (pred_8 ?v2))))


(:action op_5
:parameters (?v7 ?v8)
:precondition (and (pred_4 ?v7) (pred_4 ?v8)
               (pred_11 ?v7) (pred_5 ?v7 ?v8) (pred_12 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v7))))

(:action op_2
:parameters (?v7 ?v11)
:precondition (and (pred_4 ?v7) (pred_2 ?v11) 
                  (pred_11 ?v7) (pred_6 ?v11 ?v7) (pred_1 ))
:effect (and (pred_9 ?v11)
   (not (pred_6 ?v11 ?v7)) (not (pred_1 ))))


(:action op_3
:parameters (?v7 ?v13 ?v9)
:precondition (and (pred_4 ?v7) (pred_2 ?v13) (pred_2 ?v9)
                  (pred_11 ?v7) (pred_9 ?v9) (pred_6 ?v13 ?v7))
:effect (and (pred_9 ?v13) (pred_6 ?v9 ?v7)
        (not (pred_9 ?v9)) (not (pred_6 ?v13 ?v7))))

(:action op_1
:parameters (?v7 ?v11)
:precondition (and (pred_4 ?v7) (pred_2 ?v11) 
                  (pred_11 ?v7) (pred_9 ?v11))
:effect (and (pred_1 ) (pred_6 ?v11 ?v7) (not (pred_9 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_13 obj_04 obj_10 obj_07 obj_05 obj_06 obj_08 obj_03
    obj_11 obj_01
    obj_02 obj_09
    )

    (:init
       (pred_1)

       (pred_4 obj_12)
       (pred_4 obj_13)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_05)
       (pred_4 obj_06)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_3 obj_11)
       (pred_3 obj_01)
       (pred_2 obj_02)
       (pred_2 obj_09)

       (pred_5 obj_12 obj_10)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_12)
       (pred_5 obj_07 obj_08)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_13)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_05 obj_03)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_08 obj_03)
       (pred_5 obj_08 obj_07)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_03 obj_05)
       (pred_5 obj_03 obj_08)
       (pred_8 obj_12)
       (pred_8 obj_03)
       (pred_10  obj_12 obj_11)
       (pred_10  obj_03 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_10)
       (pred_12 obj_07)
       (pred_12 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_08)

       (pred_7  obj_02 obj_11)
       (pred_7  obj_09 obj_01)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_09 obj_05)
       (pred_11 obj_05)
    )

    (:goal (and
       (pred_6 obj_02 obj_10)
    ))
(:constraints
  (always (not (pred_11 obj_13)))
)
)

; plan
1. (op_5 obj_05 obj_04)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_04)
   goals met: 0 of 1
2. (op_2 obj_04 obj_02)
   deleted: (pred_6 obj_02 obj_04) (pred_1)
   added: (pred_9 obj_02)
   goals met: 0 of 1
3. (op_5 obj_04 obj_05)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_05)
   goals met: 0 of 1
4. (op_5 obj_05 obj_07)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_07)
   goals met: 0 of 1
5. (op_5 obj_07 obj_10)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_10)
   goals met: 0 of 1
6. (op_1 obj_10 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_1) (pred_6 obj_02 obj_10)
   goals met: 1 of 1
